try {
    var mysql = require('mysql');
}
catch (err)
    {
        alert("Для того чтоб работать с БД, установите Node.js ");
        var nameOsnova = ['iPhone 5 / 5s', 'iPhone 7 / 7+', 'iPhone Xs / Xr ', 'iPhone 11 / 11 Pro', 'iPhone 12 / 12 Pro'];
        var imgtext = 'img/';
        var ImgOsnova = [
            'img/5.jpg'
            , 'img/7.jpg'
            , 'img/Xr.jpg'
               ,'img/11.jpg'
            , 'img/12.jpg'
        ];
        var TextOsnova = [
            'Apple Silicone Case - идеальная и полная защита Вашего iPhone.\n' +
            'Чехол изготовлен из высококачественного и экологически чистого силикона. Он имеет небольшой вес и сравнительно небольшие габариты, снаружи он очень приятный на ощупь. Поверхность силикона имеет насечку - микро волна, она обеспечивает максимально простое удержание смартфона в руках и отсутствие скольжения на влажных поверхностях. На чехле отсутствуют выступы и острые углы. Чехол имеет специальную внутреннюю вставку из микрофибры, она приятная на ощупь и дополнительно гасит энергию удара, сохраняя телефон от повреждений при падении или ударе.\n' +
            'В Apple Silicone Case максимально точно учтён размер мобильного девайса - чехол идеально облегает iPhone, он абсолютно неподвижен внутри. Небольшой бортик по краю чехла в месте прилегания к тачскрину обеспечивает защиту при падении экраном вниз. Кнопки нажимаются без дополнительных усилий. Этот чехол обеспечивает беспрепятственный доступ к портам аудио выхода и зарядки, кнопкам громкости и сна.\n' +
            'Купить Apple Silicone Case - это гарантированная защита iPhone при падениях - плашмя, на боковые грани или углы, а так же от случайных ударов на улице, дома или в транспорте.',
            'Apple Silicone Case - идеальная и полная защита Вашего iPhone.\n' +
            'Чехол изготовлен из высококачественного и экологически чистого силикона. Он имеет небольшой вес и сравнительно небольшие габариты, снаружи он очень приятный на ощупь. Поверхность силикона имеет насечку - микро волна, она обеспечивает максимально простое удержание смартфона в руках и отсутствие скольжения на влажных поверхностях. На чехле отсутствуют выступы и острые углы. Чехол имеет специальную внутреннюю вставку из микрофибры, она приятная на ощупь и дополнительно гасит энергию удара, сохраняя телефон от повреждений при падении или ударе.\n' +
            'В Apple Silicone Case максимально точно учтён размер мобильного девайса - чехол идеально облегает iPhone, он абсолютно неподвижен внутри. Небольшой бортик по краю чехла в месте прилегания к тачскрину обеспечивает защиту при падении экраном вниз. Кнопки нажимаются без дополнительных усилий. Этот чехол обеспечивает беспрепятственный доступ к портам аудио выхода и зарядки, кнопкам громкости и сна.\n' +
            'Купить Apple Silicone Case - это гарантированная защита iPhone при падениях - плашмя, на боковые грани или углы, а так же от случайных ударов на улице, дома или в транспорте.',
            , 'Apple Silicone Case - идеальная и полная защита Вашего iPhone.\n' +
            'Чехол изготовлен из высококачественного и экологически чистого силикона. Он имеет небольшой вес и сравнительно небольшие габариты, снаружи он очень приятный на ощупь. Поверхность силикона имеет насечку - микро волна, она обеспечивает максимально простое удержание смартфона в руках и отсутствие скольжения на влажных поверхностях. На чехле отсутствуют выступы и острые углы. Чехол имеет специальную внутреннюю вставку из микрофибры, она приятная на ощупь и дополнительно гасит энергию удара, сохраняя телефон от повреждений при падении или ударе.\n' +
            'В Apple Silicone Case максимально точно учтён размер мобильного девайса - чехол идеально облегает iPhone, он абсолютно неподвижен внутри. Небольшой бортик по краю чехла в месте прилегания к тачскрину обеспечивает защиту при падении экраном вниз. Кнопки нажимаются без дополнительных усилий. Этот чехол обеспечивает беспрепятственный доступ к портам аудио выхода и зарядки, кнопкам громкости и сна.\n' +
            'Купить Apple Silicone Case - это гарантированная защита iPhone при падениях - плашмя, на боковые грани или углы, а так же от случайных ударов на улице, дома или в транспорте.'];
    };